Autodesk.Revit.DB.GeometryInstance.Symbol
The symbol element that this object is referring to.
This property is deprecated in Revit 2023 and may be removed in a future version of Revit.
Please use the GetDocument().GetElement(GetSymbolGeometryId().SymbolId).
In Revit 2023 we introduced nodes that point to a part of the symbol's geometry. For comparing if two such nodes point to the same geometry, the SymbolId isn't enough. SymbolGeometryId can be used to identify a piece of geometry managed by a symbol element.